Core/src/src/Documents/СчетФактураПолученныйГрузия/СчетФактураПолученныйГрузия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СчетФактураПолученныйГрузия</name>
  <basedOn>Document.ПриходнаяНакладная</basedOn>
  <basedOn>Document.АвансовыйОтчет</basedOn>
  <basedOn>Document.ДополнительныеРасходы</basedOn>
  <basedOn>Document.ОтчетПереработчика</basedOn>
  <basedOn>Document.ОтчетКомиссионера</basedOn>
  <basedOn>Document.ЗаказПоставщику</basedOn>
  <basedOn>Document.РасходСоСчета</basedOn>
  <basedOn>Document.РасходИзКассы</basedOn>
  <basedOn>Document.КорректировкаПоступления</basedOn>
  <registerRecords>AccumulationRegister.АвансыПолученныхФактур</registerRecords>
  <registerRecords>AccountingRegister.AzRyХозрасчетныйUSD</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыПоНалогам</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерВходящегоДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВходящегоДокумента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодРегистрации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Серия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерСчетФактуры</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыСФ</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Аванс</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидНалога</name>
    <type>
      <types>CatalogRef.ВидыНалогов</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаКВозмещениюРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзмененаПользователем</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДокументыОснования</name>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>DocumentRef.РасходнаяНакладная</types>
        <types>DocumentRef.ПриходнаяНакладная</types>
        <types>DocumentRef.КорректировкаПоступления</types>
        <types>DocumentRef.ОтчетПереработчика</types>
        <types>DocumentRef.Взаимозачет</types>
        <types>DocumentRef.ДополнительныеРасходы</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаДокумента</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Всего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТоварыНаПортале</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаАкциза</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Всего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДокументыПлатежа</name>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.РасходСоСчета</types>
        <types>DocumentRef.АвансовыйОтчет</types>
        <types>DocumentRef.ПоступлениеВКассу</types>
        <types>DocumentRef.РасходИзКассы</types>
        <types>DocumentRef.ПоступлениеНаСчет</types>
      </type>
    </attributes>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ID</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Core/src/src/Documents/СчетФактураПолученныйГрузия/ManagerModule.bsl
// Инициализирует таблицы значений, содержащие данные табличных частей документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаСчетФактураПолученный, СтруктураДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СчетФактураПолученныйГрузияДокументыПлатежа.Ссылка,
		|	СчетФактураПолученныйГрузияДокументыПлатежа.Ссылка.Организация,
		|	СчетФактураПолученныйГрузияДокументыПлатежа.Ссылка.Контрагент,
		|	КОНЕЦПЕРИОДА(СчетФактураПолученныйГрузияДокументыПлатежа.Ссылка.ДатаВходящегоДокумента, МЕСЯЦ) КАК Период,
		|	СчетФактураПолученныйГрузияДокументыПлатежа.НомерСтроки КАК НомерСтроки,
		|	СчетФактураПолученныйГрузияДокументыПлатежа.Документ,
		|	СчетФактураПолученныйГрузияДокументыПлатежа.Договор,
		|	СчетФактураПолученныйГрузияДокументыПлатежа.СуммаНДС КАК Сумма
		|ПОМЕСТИТЬ ДокументыПлатежа
		|ИЗ
		|	Документ.СчетФактураПолученныйГрузия.ДокументыПлатежа КАК СчетФактураПолученныйГрузияДокументыПлатежа
		|ГДЕ
		|	СчетФактураПолученныйГрузияДокументыПлатежа.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", 		ДокументСсылкаСчетФактураПолученный);
	Запрос.Выполнить();
	
	ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.СформироватьТаблицаХозрасчетный_СчетФактураПолученныйГрузия(ДокументСсылкаСчетФактураПолученный, СтруктураДополнительныеСвойства);
	ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.СформироватьТаблицаАвансыПолученныхФактур_СчетФактураПолученныйГрузия(ДокументСсылкаСчетФактураПолученный, СтруктураДополнительныеСвойства);
	
	СформироватьТаблицаРасчетыПоНалогам(ДокументСсылкаСчетФактураПолученный, СтруктураДополнительныеСвойства); // Kuzmich, 16.09.2019, Добавление бух проводок в счет фактурах
КонецПроцедуры // ИнициализироватьДанныеДокумента()

// Выполняет контроль возникновения отрицательных остатков.
//
Процедура ВыполнитьКонтроль(ДокументСсылкаСчетФактураПолученный, ДополнительныеСвойства, Отказ, УдалениеПроведения = Ложь) Экспорт
	
	Если Не УправлениеНебольшойФирмойСервер.ВыполнитьКонтрольОстатков() Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ПЕЧАТИ ФОРМЫ

// Процедура печати документа.
//
Функция ПечатнаяФорма(МассивОбъектов, ОбъектыПечати) Экспорт
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_СчетФактураПолученный";
	
	Запрос = Новый Запрос;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СчетФактураПолученный.Дата КАК ДатаДокумента,
	|	СчетФактураПолученный.Номер КАК Номер,
	|	СчетФактураПолученный.Контрагент КАК Поставщик,
	|	СчетФактураПолученный.Организация КАК Покупатель,
	|	СчетФактураПолученный.Организация КАК Плательщик,
	|	СчетФактураПолученный.Организация.Префикс КАК Префикс,
	|	СчетФактураПолученный.Договор.Представление КАК Основание,
	|	СчетФактураПолученный.ВалютаДокумента КАК Валюта,
	|	СчетФактураПолученный.ДатаВходящегоДокумента КАК ДатаПРД,
	|	СчетФактураПолученный.НомерВходящегоДокумента КАК НомерПРД,
	|	СчетФактураПолученный.ВидОперации,
	|	СчетФактураПолученный.Организация КАК Руководитель,
	|	СчетФактураПолученный.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.СчетФактураПолученный КАК СчетФактураПолученный
	|ГДЕ
	|	СчетФактураПолученный.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка";
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	Шапка = Запрос.Выполнить().Выбрать();
	
	ПервыйДокумент = Истина;
	
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
	Пока Шапка.Следующий() Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		Если Шапка.ДатаДокумента < '20090609' Тогда
			ТабличныйДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_СчетФактураПолученный_СчетФактура283";		
			Макет = УправлениеПечатью.ПолучитьМакет("Документ.СчетФактураПолученный.ПФ_MXL_СчетФактура283");
		Иначе
			ТабличныйДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_СчетФактураПолученный_СчетФактура451";		
			Макет = УправлениеПечатью.ПолучитьМакет("Документ.СчетФактураПолученный.ПФ_MXL_СчетФактура451");
		КонецЕсли;
		
		СведенияОПокупателе = УправлениеНебольшойФирмойСервер.СведенияОЮрФизЛице(Шапка.Покупатель, Шапка.ДатаДокумента, ,);
		СведенияОПоставщике  = УправлениеНебольшойФирмойСервер.СведенияОЮрФизЛице(Шапка.Поставщик, Шапка.ДатаДокумента, ,);
		
		// Выводим шапку накладной
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
		ОбластьМакета.Параметры.Заполнить(Шапка);
		
		Если Шапка.ДатаДокумента < Дата('20110101') Тогда
			НомерДокумента = УправлениеНебольшойФирмойСервер.ПолучитьНомерНаПечать(Шапка.Номер, Шапка.Префикс);
		Иначе
			НомерДокумента = ПрефиксацияОбъектовКлиентСервер.ПолучитьНомерНаПечать(Шапка.Номер, Истина, Истина);
		КонецЕсли;		
		
		ОбластьМакета.Параметры.Номер = "Счет-фактура № " + НомерДокумента
		                          + " от " + Формат(Шапка.ДатаДокумента, "ДФ='дд ММММ гггг'")+ " г.";
		ОбластьМакета.Параметры.ПредставлениеПоставщика       = "Продавец: "                         + УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПоставщике, "ПолноеНаименование,");
		ОбластьМакета.Параметры.АдресПоставщика               = "Адрес: "                            + УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПоставщике, "ЮридическийАдрес,");
		ОбластьМакета.Параметры.ПоДокументу                   = "К платежно-расчетному документу № " + Шапка.НомерПРД + " от " + Формат(Шапка.ДатаПРД, "ДФ=dd.MM.yyyy");
		ОбластьМакета.Параметры.ПредставлениеПокупателя       = "Покупатель: "                       + УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПокупателе, "ПолноеНаименование,");
		ОбластьМакета.Параметры.АдресПокупателя               = "Адрес: "                            + УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПокупателе, "ЮридическийАдрес,");
		Если Шапка.ВидОперации <> Перечисления.ВидыОперацийСчетФактураПолученный.Аванс Тогда
		    ОбластьМакета.Параметры.ПредставлениеГрузоотправителя = "Грузоотправитель и его адрес: он же";
			ОбластьМакета.Параметры.ПредставлениеГрузополучателя  = "Грузополучатель и его адрес: "  + УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПокупателе, "ПолноеНаименование,ФактическийАдрес,");
		Иначе
			ОбластьМакета.Параметры.ПредставлениеГрузоотправителя = "Грузоотправитель и его адрес: --";
			ОбластьМакета.Параметры.ПредставлениеГрузополучателя  = "Грузополучатель и его адрес: --";
		КонецЕсли; 		
			
		КПП = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПоставщике, "КПП,", Ложь);
		Если ЗначениеЗаполнено(КПП) Тогда
			КПП = "/" + КПП;
		КонецЕсли;
		ОбластьМакета.Параметры.ИННпоставщика                 = "ИНН/КПП продавца: "                 + УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПоставщике, "ИНН,", Ложь) + КПП;
		
		КПП = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПокупателе, "КПП,", Ложь);
		Если ЗначениеЗаполнено(КПП) Тогда 
			КПП = "/" + КПП;
		КонецЕсли;
		ОбластьМакета.Параметры.ИННПокупателя                 = "ИНН/КПП покупателя: "   + УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПокупателе, "ИНН,", Ложь) + КПП;
			
		ПроставитьПрочеркиВПустыеПоля(ОбластьМакета);
		ТабличныйДокумент.Вывести(ОбластьМакета);

		ОбластьМакета = Макет.ПолучитьОбласть("ЗаголовокТаблицы");
		ОбластьМакета.Параметры.Заполнить(Шапка);
		ТабличныйДокумент.Вывести(ОбластьМакета);

		ОбластьМакета = Макет.ПолучитьОбласть("Строка");
		
		ИтогоСуммаНДС = 0;
		ИтогоВсего    = 0;

	
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Ссылка", Шапка.Ссылка);

		Запрос.Текст =

		"ВЫБРАТЬ
		|	1 КАК ID,
		|	ВложенныйЗапрос.НомерСтроки КАК НомерСтроки,
		|	ВЫБОР
		|		КОГДА (ВЫРАЗИТЬ(ВложенныйЗапрос.Номенклатура.НаименованиеПолное КАК СТРОКА(1000))) = """"
		|			ТОГДА ВложенныйЗапрос.Номенклатура.Наименование
		|		ИНАЧЕ ВЫРАЗИТЬ(ВложенныйЗапрос.Номенклатура.НаименованиеПолное КАК СТРОКА(1000))
		|	КОНЕЦ КАК ТоварНаименование,
		|	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
		|	ВложенныйЗапрос.Номенклатура.Артикул КАК Артикул,
		|	ВложенныйЗапрос.Характеристика КАК Характеристика,
		|	ВложенныйЗапрос.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ВложенныйЗапрос.Количество,
		|	ВложенныйЗапрос.СуммаБезНДС,
		|	ВложенныйЗапрос.СтавкаНДС,
		|	ВложенныйЗапрос.СуммаНДС,
		|	ВложенныйЗапрос.Цена,
		|	ВложенныйЗапрос.Всего,
		|	ВложенныйЗапрос.НомерГТД КАК ПредставлениеГТД,
		|	ВложенныйЗапрос.ПредставлениеСтраны,
		|	ВложенныйЗапрос.Содержание
		|ИЗ
		|	(ВЫБРАТЬ
		|		МИНИМУМ(СчетФактураПолученныйЗапасы.НомерСтроки) КАК НомерСтроки,
		|		СчетФактураПолученныйЗапасы.Номенклатура КАК Номенклатура,
		|		СчетФактураПолученныйЗапасы.Характеристика КАК Характеристика,
		|		СчетФактураПолученныйЗапасы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|		СчетФактураПолученныйЗапасы.Цена КАК Цена,
		|		СУММА(СчетФактураПолученныйЗапасы.Количество) КАК Количество,
		|		СУММА(СчетФактураПолученныйЗапасы.Сумма) КАК СуммаБезНДС,
		|		СчетФактураПолученныйЗапасы.СтавкаНДС КАК СтавкаНДС,
		|		СУММА(СчетФактураПолученныйЗапасы.СуммаНДС) КАК СуммаНДС,
		|		СУММА(СчетФактураПолученныйЗапасы.Всего) КАК Всего,
		|		СчетФактураПолученныйЗапасы.НомерГТД КАК НомерГТД,
		|		СчетФактураПолученныйЗапасы.СтранаПроисхождения.Представление КАК ПредставлениеСтраны,
		|		ВЫРАЗИТЬ(СчетФактураПолученныйЗапасы.Содержание КАК СТРОКА(1000)) КАК Содержание
		|	ИЗ
		|		Документ.СчетФактураПолученный.Запасы КАК СчетФактураПолученныйЗапасы
		|	ГДЕ
		|		СчетФактураПолученныйЗапасы.Ссылка = &Ссылка
		|	
		|	СГРУППИРОВАТЬ ПО
		|		СчетФактураПолученныйЗапасы.НомерГТД,
		|		СчетФактураПолученныйЗапасы.ЕдиницаИзмерения,
		|		СчетФактураПолученныйЗапасы.Номенклатура,
		|		СчетФактураПолученныйЗапасы.Характеристика,
		|		ВЫРАЗИТЬ(СчетФактураПолученныйЗапасы.Содержание КАК СТРОКА(1000)),
		|		СчетФактураПолученныйЗапасы.СтавкаНДС,
		|		СчетФактураПолученныйЗапасы.Цена,
		|		СчетФактураПолученныйЗапасы.СтранаПроисхождения.Представление) КАК ВложенныйЗапрос
		|
		|УПОРЯДОЧИТЬ ПО
		|	ID,
		|	НомерСтроки";
        				
        Если  Шапка.ВидОперации = Перечисления.ВидыОперацийСчетФактураПолученный.СуммовыеРазницы Тогда
			
			ТаблицаПоТоварам = Запрос.Выполнить().Выгрузить();
			
            ОбластьМакета.Параметры.ТоварНаименование = "Суммы, связанные с расчетами по оплате (ст. 162 НК РФ)";
			
			Если ТаблицаПоТоварам.Количество() > 0 Тогда
			
				ОбластьМакета.Параметры.СтавкаНДС = ТаблицаПоТоварам[0].СтавкаНДС;          
				ОбластьМакета.Параметры.СуммаНДС = ТаблицаПоТоварам[0].СуммаНДС;          
				ОбластьМакета.Параметры.Всего = ТаблицаПоТоварам[0].Всего;

	            ИтогоСуммаНДС = ТаблицаПоТоварам[0].СуммаНДС;
				ИтогоВсего    = ТаблицаПоТоварам[0].Всего;
				
			КонецЕсли;

            ПроставитьПрочеркиВПустыеПоля(ОбластьМакета);		
            ТабличныйДокумент.Вывести(ОбластьМакета);


		ИначеЕсли  Шапка.ВидОперации = Перечисления.ВидыОперацийСчетФактураПолученный.Поступление Тогда 

			ТаблицаПоТоварам = Запрос.Выполнить().Выгрузить();
			
			Для Каждого Строчка Из ТаблицаПоТоварам Цикл
				ОбластьМакета.Параметры.Заполнить(Строчка);

				Если Строка(Строчка.ПредставлениеСтраны) = "Россия" Тогда
					ОбластьМакета.Параметры.ПредставлениеСтраны  = "----";
				КонецЕсли; 

				Если ЗначениеЗаполнено(Строчка.Содержание) Тогда
					ОбластьМакета.Параметры.ТоварНаименование = Строчка.Содержание;
				Иначе
					ОбластьМакета.Параметры.ТоварНаименование = УправлениеНебольшойФирмойСервер.ПолучитьПредставлениеНоменклатурыДляПечати(Строчка.ТоварНаименование, 
																Строчка.Характеристика, Строчка.Артикул);
				КонецЕсли;

				Количество  = Строчка.Количество;

				ОбластьМакета.Параметры.Количество = Количество;
				Если Строчка.Цена <> 0 Тогда
					ОбластьМакета.Параметры.Цена   = ?(Количество = 0, 0, Строчка.СуммаБезНДС / Количество);
				Иначе
					ОбластьМакета.Параметры.Цена   = Строчка.Цена;
				КонецЕсли;
				ОбластьМакета.Параметры.Стоимость  = Строчка.СуммаБезНДС;
					
				ОбластьМакета.Параметры.Всего      = Строчка.Всего;
				ОбластьМакета.Параметры.СтавкаНДС  = Строчка.СтавкаНДС;

				ИтогоСуммаНДС = ИтогоСуммаНДС + Строчка.СуммаНДС;
				ИтогоВсего    = ИтогоВсего    + Строчка.Всего;

				ПроставитьПрочеркиВПустыеПоля(ОбластьМакета);
				ТабличныйДокумент.Вывести(ОбластьМакета);

			КонецЦикла;	
			
		ИначеЕсли  Шапка.ВидОперации = Перечисления.ВидыОперацийСчетФактураПолученный.Аванс Тогда 

			Запрос.Текст =

			"ВЫБРАТЬ
			|	1 КАК ID,
			|	ВложенныйЗапрос.НомерСтроки КАК НомерСтроки,
			|	ВложенныйЗапрос.Номенклатура.НаименованиеПолное КАК ТоварНаименование,
			|	ВложенныйЗапрос.Номенклатура.Артикул КАК Артикул,
			|	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
			|	ВложенныйЗапрос.Характеристика КАК Характеристика,
			|	ВложенныйЗапрос.СуммаБезНДС,
			|	ВложенныйЗапрос.СтавкаНДС,
			|	ВложенныйЗапрос.СуммаНДС,
			|	ВложенныйЗапрос.Всего,
			|	ВложенныйЗапрос.Содержание
			|ИЗ
			|	(ВЫБРАТЬ
			|		МИНИМУМ(СчетФактураПолученныйЗапасы.НомерСтроки) КАК НомерСтроки,
			|		СчетФактураПолученныйЗапасы.Номенклатура КАК Номенклатура,
			|		СчетФактураПолученныйЗапасы.Характеристика КАК Характеристика,
			|		СУММА(СчетФактураПолученныйЗапасы.Сумма) КАК СуммаБезНДС,
			|		СчетФактураПолученныйЗапасы.СтавкаНДС КАК СтавкаНДС,
			|		СУММА(СчетФактураПолученныйЗапасы.СуммаНДС) КАК СуммаНДС,
			|		СУММА(СчетФактураПолученныйЗапасы.Всего) КАК Всего,
			|		ВЫРАЗИТЬ(СчетФактураПолученныйЗапасы.Содержание КАК СТРОКА(1000)) КАК Содержание
			|	ИЗ
			|		Документ.СчетФактураПолученный.Запасы КАК СчетФактураПолученныйЗапасы
			|	ГДЕ
			|		СчетФактураПолученныйЗапасы.Ссылка = &Ссылка
			|	
			|	СГРУППИРОВАТЬ ПО
			|		СчетФактураПолученныйЗапасы.Номенклатура,
			|		СчетФактураПолученныйЗапасы.Характеристика,
			|		СчетФактураПолученныйЗапасы.СтавкаНДС,
			|		ВЫРАЗИТЬ(СчетФактураПолученныйЗапасы.Содержание КАК СТРОКА(1000))) КАК ВложенныйЗапрос
			|
			|УПОРЯДОЧИТЬ ПО
			|	ID,
			|	НомерСтроки";
			
			ТаблицаПоТоварам = Запрос.Выполнить().Выгрузить();
			
			Для Каждого Строчка Из ТаблицаПоТоварам Цикл

				Если ЗначениеЗаполнено(Строчка.Содержание) Тогда
					ОбластьМакета.Параметры.ТоварНаименование = Строчка.Содержание;
				Иначе
					ОбластьМакета.Параметры.ТоварНаименование = УправлениеНебольшойФирмойСервер.ПолучитьПредставлениеНоменклатурыДляПечати(Строчка.ТоварНаименование, 
																		Строчка.Характеристика, Строчка.Артикул);
 				КонецЕсли; 
				
				ОбластьМакета.Параметры.Всего      = Строчка.Всего;
				ОбластьМакета.Параметры.СтавкаНДС  = Строчка.СтавкаНДС;
                ОбластьМакета.Параметры.СуммаНДС   = Строчка.СуммаНДС;

				ИтогоСуммаНДС = ИтогоСуммаНДС + Строчка.СуммаНДС;
				ИтогоВсего    = ИтогоВсего    + Строчка.Всего;

				ПроставитьПрочеркиВПустыеПоля(ОбластьМакета);
				ТабличныйДокумент.Вывести(ОбластьМакета);

			КонецЦикла;

		КонецЕсли;

		ОбластьМакета = Макет.ПолучитьОбласть("Итого");
		ОбластьМакета.Параметры.ИтогоСуммаНДС = ИтогоСуммаНДС;
		ОбластьМакета.Параметры.ИтогоВсего    = ИтогоВСего;
		
		ПроставитьПрочеркиВПустыеПоля(ОбластьМакета);
		ТабличныйДокумент.Вывести(ОбластьМакета);

		ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
		
		Руководители = УправлениеНебольшойФирмойСервер.ОтветственныеЛицаОрганизационнойЕдиницы(Шапка.Руководитель, Шапка.ДатаДокумента);

		ОбластьМакета.Параметры.Заполнить(Руководители);
		
		ПроставитьПрочеркиВПустыеПоля(ОбластьМакета);
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);
		
	КонецЦикла;
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	Возврат ТабличныйДокумент;
	
КонецФункции // ПечатнаяФорма()

// Процедура простоавляет прочерки в пустые поля.
//
Процедура ПроставитьПрочеркиВПустыеПоля(ОбластьМакета)

	Для т = 0 По ОбластьМакета.Параметры.Количество() - 1 Цикл
		
		ТекПараметр = ОбластьМакета.Параметры.Получить(т);
		
		Если (Найти(ТекПараметр, "Продавец:") <> 0)
		   и (СокрЛП(ТекПараметр) = "Продавец:") Тогда
			ОбластьМакета.Параметры.Установить(т, "Продавец: ----");
			
		ИначеЕсли (Найти(ТекПараметр, "Адрес:") <> 0)
			    и (СокрЛП(ТекПараметр) = "Адрес:") Тогда
			ОбластьМакета.Параметры.Установить(т, "Адрес: ----");
			
		ИначеЕсли (Найти(ТекПараметр, "Идентификационный номер продавца (ИНН):") <> 0)
			    и (СокрЛП(ТекПараметр) = "Идентификационный номер продавца (ИНН):") Тогда
			ОбластьМакета.Параметры.Установить(т, "Идентификационный номер продавца (ИНН): ----");
			
		ИначеЕсли (Найти(ТекПараметр, "Грузоотправитель и его адрес:") <> 0)
			    и (СокрЛП(ТекПараметр) = "Грузоотправитель и его адрес:") Тогда
			ОбластьМакета.Параметры.Установить(т, "Грузоотправитель и его адрес: ----");
			
		ИначеЕсли (Найти(ТекПараметр, "Грузополучатель и его адрес:") <> 0)
		   		и (СокрЛП(ТекПараметр) = "Грузополучатель и его адрес:") Тогда
			ОбластьМакета.Параметры.Установить(т, "Грузополучатель и его адрес: ----");
			
		ИначеЕсли (Найти(ТекПараметр, "К платежно-расчетному документу №") <> 0)
		   		и (СокрЛП(ТекПараметр) = "К платежно-расчетному документу №  от") Тогда
			ОбластьМакета.Параметры.Установить(т, "К платежно-расчетному документу № -- от --");
			
		ИначеЕсли (Найти(ТекПараметр, "Покупатель:") <> 0)
		   		и (СокрЛП(ТекПараметр) = "Покупатель:") Тогда
			ОбластьМакета.Параметры.Установить(т, "Покупатель: ----");
			
		ИначеЕсли (Найти(ТекПараметр, "Идентификационный номер покупателя (ИНН):") <> 0)
			    и (СокрЛП(ТекПараметр) = "Идентификационный номер покупателя (ИНН):") Тогда
			ОбластьМакета.Параметры.Установить(т, "Идентификационный номер покупателя (ИНН): ----");
			
		ИначеЕсли НЕ ЗначениеЗаполнено(ТекПараметр) Тогда
			ОбластьМакета.Параметры.Установить(т, "--");
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // ПроставитьПрочеркиВПустыеПоля()

// Сформировать печатные формы объектов
//
// ВХОДЯЩИЕ:
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
//
// ИСХОДЯЩИЕ:
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, 

	КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт

	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;

	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "СчетФактура") Тогда

		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "СчетФактура", "Счет-фактура", ПечатнаяФорма(МассивОбъектов, ОбъектыПечати));

	КонецЕсли;
	
КонецПроцедуры

// Получает данные печати для документов
// 
// Параметры:
//	МассивДокументов - Массив ДокументСсылка.ОПТИМУС_СчетФактураПолученныйЛок - Массив документов для получения данных
//	МассивИменМакетов - Массив Строка - Массив имени макетов для получения данных
//	
// Возвращаемое значение:
//	Структура - Данные печати
//	
Функция ПолучитьДанныеПечати(знач МассивДокументов, знач МассивИменМакетов) Экспорт
	
	ДанныеПоВсемОбъектам = Новый Соответствие;
	ОписаниеОбластей = Новый Соответствие;
	ДвоичныеДанныеМакетов = Новый Соответствие;
	ТипыМакетов = Новый Соответствие;
	
	Возврат Новый Структура("Данные, Макеты",
							ДанныеПоВсемОбъектам,
							Новый Структура("ОписаниеОбластей, ТипыМакетов, ДвоичныеДанныеМакетов",
											ОписаниеОбластей,
											ТипыМакетов,
											ДвоичныеДанныеМакетов));
	
КонецФункции

// Kuzmich, 16.09.2019, Добавление бух проводок в счет фактурах
Процедура СформироватьТаблицаРасчетыПоНалогам(ДокументСсылкаСчетФактураПолученный, СтруктураДополнительныеСвойства)
	
	Если ЗначениеЗаполнено(ДокументСсылкаСчетФактураПолученный.ВидНалога) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СчетФактураПолученныйГрузияДокументыОснования.Ссылка.Дата КАК Период,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
		|	СчетФактураПолученныйГрузияДокументыОснования.Ссылка.Организация КАК Организация,
		|	СчетФактураПолученныйГрузияДокументыОснования.Ссылка.ВидНалога КАК ВидНалога,
		|	СчетФактураПолученныйГрузияДокументыОснования.Ссылка.СчетУчетаКВозмещениюРегл КАК СчетУчета,
		|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НДС) КАК СрокУплаты,
		|	&СодержаниеПроводки КАК СодержаниеПроводки,
		|	СчетФактураПолученныйГрузияДокументыОснования.СуммаНДС КАК Сумма
		|ИЗ
		|	Документ.СчетФактураПолученныйГрузия.ДокументыОснования КАК СчетФактураПолученныйГрузияДокументыОснования
		|ГДЕ
		|	СчетФактураПолученныйГрузияДокументыОснования.Ссылка = &Ссылка
		//++11.09.2025 ONESOFT-4346
		|	И ВЫБОР
		|			КОГДА СчетФактураПолученныйГрузияДокументыОснования.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыСФ.ОтправленнаяКорректировочная)
		|					ИЛИ СчетФактураПолученныйГрузияДокументыОснования.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыСФ.ПодтвержденнаяКорректировочная)
		|					ИЛИ СчетФактураПолученныйГрузияДокументыОснования.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыСФ.КОтправкеКорректировочная)
		|				ТОГДА НЕ СчетФактураПолученныйГрузияДокументыОснования.ДокументОснование.Ссылка ССЫЛКА Документ.ПриходнаяНакладная
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ 
		//++11.09.2025 ONESOFT-4346
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	СчетФактураПолученныйГрузияДокументыОснования.Ссылка.Дата,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
		|	СчетФактураПолученныйГрузияДокументыОснования.Ссылка.Организация,
		|	СчетФактураПолученныйГрузияДокументыОснования.ДокументОснование.ВидНалогаНДС,
		|	СчетФактураПолученныйГрузияДокументыОснования.Ссылка.СчетУчетаКВозмещениюРегл,
		|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НДС),
		|	&СодержаниеПроводки,
		|	СчетФактураПолученныйГрузияДокументыОснования.СуммаНДС
		|ИЗ
		|	Документ.СчетФактураПолученныйГрузия.ДокументыОснования КАК СчетФактураПолученныйГрузияДокументыОснования
		|ГДЕ
		|	СчетФактураПолученныйГрузияДокументыОснования.Ссылка = &Ссылка
		//++11.09.2025 ONESOFT-4346
		|	И ВЫБОР
		|			КОГДА СчетФактураПолученныйГрузияДокументыОснования.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыСФ.ОтправленнаяКорректировочная)
		|					ИЛИ СчетФактураПолученныйГрузияДокументыОснования.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыСФ.ПодтвержденнаяКорректировочная)
		|					ИЛИ СчетФактураПолученныйГрузияДокументыОснования.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыСФ.КОтправкеКорректировочная)
		|				ТОГДА НЕ СчетФактураПолученныйГрузияДокументыОснования.ДокументОснование.Ссылка ССЫЛКА Документ.ПриходнаяНакладная
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ";  
		//++11.09.2025 ONESOFT-4346
		
		Запрос.УстановитьПараметр("Ссылка",	ДокументСсылкаСчетФактураПолученный);
		Запрос.УстановитьПараметр("СодержаниеПроводки",	НСТР("ka='დღგ';ru='НДС';en='VAT'"));
		
		РезультатЗапроса = Запрос.Выполнить();
		врТаблицаРасчетыПоНалогам = РезультатЗапроса.Выгрузить();	
		врТаблицаРасчетыПоНалогам.Свернуть("Период,ВидДвижения,Организация,ВидНалога,СчетУчета,СрокУплаты,СодержаниеПроводки","Сумма");
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетыПоНалогам", врТаблицаРасчетыПоНалогам);
		
	КонецЕсли;
КонецПроцедуры
// Kuzmich, 16.09.2019, Добавление бух проводок в счет фактурах

Функция СуммыДокументаДляСчетФактурыПолученного(ДокументСсылка) Экспорт

	Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ДополнительныеРасходы") Тогда
		СуммаНДСДокумент = ДокументСсылка.Расходы.Итог("СуммаНДС");
	Иначе
		СуммаНДСДокумент = ДокументСсылка.Запасы.Итог("СуммаНДС") + ?(ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ПриходнаяНакладная"), ДокументСсылка.Расходы.Итог("СуммаНДС"), 0);
	КонецЕсли;
	СуммаВсего 			= ДокументСсылка.СуммаДокумента;
	//_lazare
	Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ПриходнаяНакладная") Тогда
		СуммаДокумент		= СуммаВсего;
	Иначе
	//lazare_
		СуммаДокумент		= СуммаВсего - СуммаНДСДокумент;
	КонецЕсли;
	
	// Олег Литвиненко 17.11.22 --->
	//Для РасходнаяНакладная суммы должны быть отрицательные
	Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.РасходнаяНакладная") Тогда
		СуммаДокумент = ?(СуммаВсего>0, -СуммаВсего, СуммаВсего);
		СуммаНДСДокумент = ?(СуммаНДСДокумент>0, -СуммаНДСДокумент,СуммаНДСДокумент);
		СуммаВсего = ?(СуммаВсего>0, -СуммаВсего, СуммаВсего);
	КонецЕсли;
	// Олег Литвиненко <---
	
	Возврат Новый Структура("СуммаДокумента, СуммаНДС, Всего", СуммаДокумент, СуммаНДСДокумент, СуммаВсего);
	
КонецФункции
